

racetrack_mappings = {
    '札幌'   :  1,
    '函館'   :  2,
    '福島'   :  3,
    '新潟'   :  4,
    '東京'   :  5,
    '中山'   :  6,
    '中京'   :  7,
    '京都'   :  8,
    '阪神'   :  9,
    '小倉'   : 10,
    '門別'   : 30,
    '盛岡'   : 35,
    '水沢'   : 36,
    '浦和'   : 42,
    '船橋'   : 43,
    '大井'   : 44,
    '川崎'   : 45,
    '金沢'   : 46,
    '笠松'   : 47,
    '名古屋' : 48,
    '園田'   : 50,
    '姫路'   : 51,
    '福山'   : 53,
    '高知'   : 54,
    '佐賀'   : 55,           

    'メイダン'   : 101,
    'キングア'   : 102,
    'ソウル'     : 103,
    'チャーチ'   : 104,
    'アラブ首'   : 105,
    '韓国'       : 106,    
}

racetrack_mappings___ = {
    '浦和'   : 42,
    '船橋'   : 43,
    '大井'   : 44,
    '川崎'   : 45,          
}

racetrack_mappings__ = {
    '門別'   : 30,
    '盛岡'   : 35,
    '水沢'   : 36,
}
