
KAMAKURA_KINEN_DAY = ["2020/10/14","2021/10/13","2022/10/12"]
horse_nums_kamakura_kinen_3_race        = [
                        #["2011105041","2013/10/09"],#ストーンリバー
                        #["2012103422","2014/10/15"],#ストーンリバー
                        #["2013103885","2015/10/21"],#ストーンリバー
                        #["2014101408","2016/10/05"],#ストーンリバー
                        #["2015102718","2017/10/11"],#リコーワルサー
                        #["2016100981","2018/10/17"],#ミューチャリー
                        #["2017106186","2019/10/22"],#リーチ
                        ["2018100548",KAMAKURA_KINEN_DAY[0]],#リーチ 
                        ["2018106265",KAMAKURA_KINEN_DAY[0]],#セイカメテオポリス 
                        ["2018104297",KAMAKURA_KINEN_DAY[0]],#
                        ["2018101610",KAMAKURA_KINEN_DAY[0]],#
                        ["2018100538",KAMAKURA_KINEN_DAY[0]],#
                        ["2018101832",KAMAKURA_KINEN_DAY[0]],#
                        ["2018103889",KAMAKURA_KINEN_DAY[0]],#
                        ["2018105632",KAMAKURA_KINEN_DAY[0]],#
                        ["2018101265",KAMAKURA_KINEN_DAY[0]],#
                        ["2018103742",KAMAKURA_KINEN_DAY[0]],#
                        ["2018102189",KAMAKURA_KINEN_DAY[0]],#
                        ["2018100753",KAMAKURA_KINEN_DAY[0]],#                         
                        ["2018104523",KAMAKURA_KINEN_DAY[0]],#                        
                        ["2019106611",KAMAKURA_KINEN_DAY[1]],#シルトプレ
                        ["2019101115","2021/10/13"],#
                        ["2019104404","2021/10/13"],#
                        ["2019102021","2021/10/13"],#
                        ["2019104402","2021/10/13"],#
                        ["2019100930","2021/10/13"],#
                        ["2019101048","2021/10/13"],#
                        ["2019100230","2021/10/13"],#
                        ["2019105589","2021/10/13"],#                                                  
                        ["2020104196",KAMAKURA_KINEN_DAY[2]],#ヒーローコール
                        ["2020102237","2022/10/12"],#
                        ["2020105092","2022/10/12"],#
                        ["2020103179","2022/10/12"],#
                        ["2020105017","2022/10/12"],#
                        ["2020102495","2022/10/12"],#
                        ["2020100825","2022/10/12"],#
                        ["2020105359","2022/10/12"],#
                        ["2020109007","2022/10/12"],#                                                                                                                                                                               
                        ]

kamakura_kinen_2023   = [
                        ["2021100815","2023/10/12"],#パンセ
                        ["2021106935","2023/10/12"],#サンノトーレ
                        ["2021100316","2023/10/12"],#アジアミッション 
                        ["2021100034","2023/10/12"],#カタルシス
                        ["2021104139","2023/10/12"],#アムクラージュ       
                        ["2021105761","2023/10/12"],#スノーシュー
                        ["2021100008","2023/10/12"],#ホークマン
                        ["2021103951","2023/10/12"],#メイプルケンジ
                        ["2021106020","2023/10/12"],#エドノビートイン
                        ["2021104387","2023/10/12"],#ライゾマティクス                                          
                        ["2021101290","2023/10/12"],#モンゲースパイ
                    ]

BROSSOM_CUP_DAY = ["2020/11/03","2021/10/21","2022/10/04"]
horse_nums_blossom_cup_3_race        = [
                        ["2018106228",BROSSOM_CUP_DAY[0]], 
                        ["2018102290",BROSSOM_CUP_DAY[0]], 
                        ["2018105479",BROSSOM_CUP_DAY[0]], 
                        ["2018109033",BROSSOM_CUP_DAY[0]], 
                        ["2018103508",BROSSOM_CUP_DAY[0]], 
                        ["2018101666",BROSSOM_CUP_DAY[0]], 
                        ["2018101138",BROSSOM_CUP_DAY[0]],
                        ["2018103663",BROSSOM_CUP_DAY[0]],
                        ["2018106497",BROSSOM_CUP_DAY[0]],
                        ["2018101144",BROSSOM_CUP_DAY[0]],
                        ["2018102796",BROSSOM_CUP_DAY[0]],

                        ["2019100750",BROSSOM_CUP_DAY[1]],
                        ["2019102224",BROSSOM_CUP_DAY[1]],
                        ["2019100149",BROSSOM_CUP_DAY[1]],
                        ["2019102504",BROSSOM_CUP_DAY[1]],
                        ["2019100123",BROSSOM_CUP_DAY[1]],
                        ["2019104513",BROSSOM_CUP_DAY[1]],
                        ["2019100381",BROSSOM_CUP_DAY[1]],
                        ["2019105577",BROSSOM_CUP_DAY[1]],

                        ["2020100492",BROSSOM_CUP_DAY[2]], 
                        ["2020106916",BROSSOM_CUP_DAY[2]], 
                        ["2020102173",BROSSOM_CUP_DAY[2]], 
                        ["2020101320",BROSSOM_CUP_DAY[2]], 
                        ["2020104873",BROSSOM_CUP_DAY[2]], 
                        ["2020104137",BROSSOM_CUP_DAY[2]], 
                        ["2020107100",BROSSOM_CUP_DAY[2]], 
                        ["2020101366",BROSSOM_CUP_DAY[2]],                                   

                        ]

BROSSOM_CUP_DAY_THIS_YEAR = "2023/10/12"
horse_nums_blossom_cup_2023   = [
                        ["2021103094",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021101385",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021109044",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021100813",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021102868",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021101889",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021106726",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021103388",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021101156",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021107038",BROSSOM_CUP_DAY_THIS_YEAR],
                        ["2021101141",BROSSOM_CUP_DAY_THIS_YEAR],
                        ]



object_race = horse_nums_blossom_cup_3_race
object_this_year_race = horse_nums_blossom_cup_2023


